Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Set whether the RecyclerView should try to keep the same Item focused after a layout calculation or not.
zh_cn: 设置是否 RecyclerView 应该努力保留相同 item 的焦点当一次布局计算以后。

source: Set whether to display the activity logo rather than the activity icon.
zh_cn: 设置是否显示 activity 徽标而不是 activity 图标。

source: Set whether to include the application home affordance in the action bar.
zh_cn: 设置是否在操作栏中包含应用程序主目录功能。

source: Sets a ConstraintSet object to manage constraints.
zh_cn: 设置一个 ConstraintSet 对象来管理约束。

source: Sets a drawable as the content of this ImageView.
zh_cn: 将 drawable 设置为此 ImageView 的内容。

source: Sets a new RecyclerView.ViewCacheExtension to be used by the Recycler.
zh_cn: 设置一个新的 RecyclerView.ViewCacheExtension 给 Recycler 使用。

source: Sets how long a transition animation should run (in milliseconds) when layout has changed.
zh_cn: 设置布局更改后转换动画应运行的时间(以毫秒为单位)。

source: Sets how the height is calculated ether MATCH_CONSTRAINT_WRAP or MATCH_CONSTRAINT_SPREAD.
zh_cn: 设置高度如何计算，MATCH_CONSTRAINT_WRAP 或者 MATCH_CONSTRAINT_SPREAD.

source: Sets how the width is calculated ether MATCH_CONSTRAINT_WRAP or MATCH_CONSTRAINT_SPREAD.
zh_cn: 设置宽度如何计算，MATCH_CONSTRAINT_WRAP 或者 MATCH_CONSTRAINT_SPREAD.

source: Sets the RecyclerView.ChildDrawingOrderCallback to be used for drawing children.
zh_cn: 设置 RecyclerView.ChildDrawingOrderCallback 用来绘制子 view 时使用。

source: Sets the RecyclerView.ItemAnimator that will handle animations involving changes to the items in this RecyclerView.
zh_cn: 设置 RecyclerView.ItemAnimator，它将处理该 RecyclerView 中涉及改变的 item 的动画。

source: Sets the acceleration curve for the indeterminate animation.
zh_cn: 设置不确定动画的加速度曲线。

source: Sets the alpha on the items that are not selected.
zh_cn: 设置未选中项目的 alpha。

source: Sets the bottom title margin in pixels.
zh_cn: 以像素为单位设置底部标题边距。

source: Sets the color of the ambient shadow that is drawn when the view has a positive Z or elevation value.
zh_cn: 设置当 view 具有正 Z 或高程值时绘制的环境阴影的颜色。

source: Sets the color of the spot shadow that is drawn when the view has a positive Z or elevation value.
zh_cn: 设置当 view 具有正 Z 或高程值时绘制的专色阴影的颜色。

source: Sets the color of the status bar to color.
zh_cn: 将状态栏的颜色设置为 color。

source: Sets the content insets for this toolbar relative to layout direction.
zh_cn: 设置此工具栏相对于布局方向的内容内缩。

source: Sets the content insets for this toolbar.
zh_cn: 设置此工具栏的内容内缩。

source: Sets the degrees that the view is rotated around the horizontal axis through the pivot point.
zh_cn: 设置 view 围绕水平轴旋转通过轴心点的度数。

source: Sets the degrees that the view is rotated around the pivot point.
zh_cn: 设置 view 围绕轴心点旋转的度数。

source: Sets the degrees that the view is rotated around the vertical axis through the pivot point.
zh_cn: 设置 view 围绕垂直轴旋转的度数。

source: Sets the distance along the Z axis (orthogonal to the X/Y plane on which views are drawn) from the camera to this view.
zh_cn: 设置从相机到该 view 沿 Z 轴(与绘制 view 的 X/Y 平面正交)的距离。

source: Sets the ending title margin in pixels.
zh_cn: 以像素为单位设置结束侧标题边距。

source: Sets the final position (X) for this scroller.
zh_cn: 设置此 scroller 的最终位置(X)。

source: Sets the final position (Y) for this scroller.
zh_cn: 设置此 scroller 的最终位置(Y)。

source: Sets the gone margin.
zh_cn: 设置 gone margin。

source: Sets the height of the view.
zh_cn: 设置 view 的高度。

source: Sets the id of the view that the AppBarLayout should use to determine whether it should be lifted.
zh_cn: 设置 AppBarLayout 应该用于确定是否应该提升的 view 的 id。

source: Sets the last point of the path.
zh_cn: 设置路径的最后一个点。

source: Sets the limits of this matcher's region.
zh_cn: 设置此匹配器的区域限制。

source: Sets the margin.
zh_cn: 设置 margin。

source: Sets the maximum height of the view.
zh_cn: 设置 view 的最大高度。

source: Sets the maximum width of the view.
zh_cn: 设置 view 的最大宽度。

source: Sets the padding, in pixels, of all four edges.
zh_cn: 设置所有四条边的 padding(填充)(以像素为单位)。

source: Sets the padding, in pixels, of the bottom edge; see R.attr.padding.
zh_cn: 设置底边的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the end edge; see R.attr.padding.
zh_cn: 设置结束边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the left and right edges; see R.attr.padding.
zh_cn: 设置左右边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the left edge; see R.attr.padding.
zh_cn: 设置左边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the right edge; see R.attr.padding.
zh_cn: 设置右边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the start edge; see R.attr.padding.
zh_cn: 设置起始边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the top and bottom edges; see R.attr.padding.
zh_cn: 设置顶部和底部边缘的填充(以像素为单位);参见 R.attr.padding。

source: Sets the padding, in pixels, of the top edge; see R.attr.padding.
zh_cn: 设置顶边的填充(以像素为单位);参见 R.attr.padding。

source: Sets the start content inset to use when a navigation button is present.
zh_cn: 设置导航按钮存在时要使用的起始侧内容内缩。

source: Sets the start content inset to use when action buttons are present.
zh_cn: 设置操作按钮存在时要使用的开始侧内容内缩。

source: Sets the starting title margin in pixels.
zh_cn: 以像素为单位设置起始侧标题边距。

source: Sets the state-based animator for the View.
zh_cn: 为 View 设置基于状态的 animator。

source: Sets the text color of the subtitle, if present.
zh_cn: 设置副标题的文本颜色(如果有)。

source: Sets the text color of the title, if present.
zh_cn: 设置标题的文本颜色(如果存在)。

source: Sets the text color, size, style, hint color, and highlight color from the specified TextAppearance resource.
zh_cn: 从指定 TextAppearance 的资源设置文本颜色，大小，样式，提示颜色和高亮颜色。

source: Sets the title margin.
zh_cn: 设置标题边距。

source: Sets the top title margin in pixels.
zh_cn: 以像素为单位设置顶部标题边距。

source: Sets the transcript mode for the list.
zh_cn: 设置列表的 transcript 模式。

source: Sets the width of the view.
zh_cn: 设置 view 的宽度。

source: Sets the width of vertical scrollbars and height of horizontal scrollbars.
zh_cn: 设置垂直滚动条的宽度和水平滚动条的高度。

source: Sets whether or not this view should account for system screen decorations such as the status bar and inset its content; that is, controlling whether the default implementation of fitSystemWindows(Rect) will be executed.
zh_cn: 设置此 view 是否应考虑系统屏幕装饰，例如状态栏和其内容的 inset ;也就是说，控制是否执行 fitSystemWindows(Rect) 的默认实现。

source: Sets whether the AppBarLayout is in a lifted state or not.
zh_cn: 设置 AppBarLayout 是否处于提升状态。

source: Sets whether the AppBarLayout is liftable or not.
zh_cn: 设置 AppBarLayout 是否可升降。

source: Sets whether the AppBarLayout lifts on scroll or not.
zh_cn: 设置 AppBarLayout 是否在滚动时提升。

source: Sets whether the results of getSpanIndex(int, int) method should be cached or not.
zh_cn: 设置 getSpanIndex(int, int) 方法的结果是否是缓存的。

source: Sets whether this AppBarLayout is expanded or not, animating if it has already been laid out.
zh_cn: 设置是否展开此 AppBarLayout，如果已经布局，则会进行动画。

source: Sets whether this AppBarLayout is expanded or not.
zh_cn: 设置是否展开 AppBarLayout。

source: Sets whether this ViewGroup should split MotionEvents to separate child views during touch event dispatch.
zh_cn: 设置此 ViewGroup 是否应在触摸事件调度期间将 MotionEvent 拆分为单独的子 view。

source: Sets whether this ViewGroup's drawable states also include its children's drawable states.
zh_cn: 设置此 ViewGroup 的可绘制状态是否还包括其子项的可绘制状态。

source: Sets whether to consider all children, or just those in the VISIBLE or INVISIBLE state, when measuring.
zh_cn: 设置在测量时是否考虑所有子项，或仅考虑处于 VISIBLE 或 INVISIBLE 状态的子项。

source: Setting a new behavior will remove any currently associated Behavior tag.
zh_cn: 设置新行为将移除任何当前关联的 Behavior tag。

source: Setting an icon will make the navigation button visible.
zh_cn: 设置图标将使导航按钮可见。

source: Setting this option will implicitly enable interaction with the home/up button.
zh_cn: 设置此选项将隐式启用与 home/up 按钮的交互。

source: Several stock layout managers are provided for general use.
zh_cn: 提供一些自带的 layout managers 用于一般使用。

source: Shader is the based class for objects that return horizontal spans of colors during drawing.
zh_cn: Shader （着色器）是绘制过程中返回水平跨度颜色的对象的基类。

source: Shader used to draw a bitmap as a texture.
zh_cn: 用于绘制位图作为纹理的着色器。

source: Should be between 0 (inclusive) and spanCount(exclusive)
zh_cn: 应该在[0,spanCount)间。

source: Should the layout be a column or a row?
zh_cn: 布局应该是列还是行？

source: Show 'home' elements in this action bar, leaving more space for other navigation elements.
zh_cn: 在此操作栏中显示“主页”元素，为其他导航元素留出更多空间。

source: Show the ActionBar if it is not currently showing.
zh_cn: 如果操作栏当前未显示，则显示它。

source: Show the activity title and subtitle, if present.
zh_cn: 显示 activity 标题和副标题(如果存在)。

source: Show the custom view if one has been set.
zh_cn: 显示自定义 view(如果已设置)。

source: Show the overflow items from the associated menu.
zh_cn: 显示相关菜单中的溢出项目。

source: Show the progress bar in your app's user interface or in a notification instead of within a dialog.
zh_cn: 在应用的用户界面或通知中显示进度条，而不是在对话框中显示。

source: Showing a button that when clicked displays a dropdown menu.
zh_cn: 显示单击时显示下拉菜单的按钮。

source: Showing a character counter via setCounterEnabled(boolean) and setCounterMaxLength(int)
zh_cn: 通过 setCounterEnabled(boolean) 和 setCounterMaxLength(int) 显示字符计数器

source: Showing a custom icon specified via setEndIconMode(int) API and related attribute.
zh_cn: 显示通过 setEndIconMode(int) API 和相关属性指定的自定义图标。

source: Showing a start icon via setStartIconDrawable(Drawable) API and related attribute.
zh_cn: 通过 setStartIconDrawable(Drawable) API 及相关属性显示开始图标。

source: Showing an error via setErrorEnabled(boolean) and setError(CharSequence)
zh_cn: 通过 setErrorEnabled(boolean) 和 setError(CharSequence) 显示错误

source: Showing helper text via setHelperTextEnabled(boolean) and setHelperText(CharSequence)
zh_cn: 通过 setHelperTextEnabled(boolean) 和 setHelperText(CharSequence) 显示帮助

source: Shows a list of query suggestions or results, if available, and allows the user to pick a suggestion or result to launch into.
zh_cn: 显示查询建议或结果列表(如果可用)，并允许用户选择要启动的建议或结果。

source: Similarly, if in the course of processing the event the view's appearance may need to be changed, the view will call invalidate().
zh_cn: 相似的，如果处理事件的过程中，view 的显示要发生变化，可以调用 invalidate() 方法。

source: Similarly, the textAppearance and the related setTypeface() methods control the typeface and style of label text, whereas the switchTextAppearance and the related setSwitchTypeface() methods control that of the thumb.
zh_cn: 类似地，textAppearance 和相关的 setTypeface() 方法控制标签文本的字体和样式，而 switchTextAppearance 和相关的 setSwitchTypeface() 方法控制 thumb。

source: Similarly, you can define/override the inflate View's id by using the ViewStub's inflatedId property.
zh_cn: 同样，你可以使用 ViewStub 的 inflatedId 属性定义/重写 inflate View 的 id。

source: Simple ViewAnimator that will animate between two or more views that have been added to it.
zh_cn: 简单 ViewAnimator，它将在已添加到其中的两个或多个 view 之间进行动画处理。

source: Simple implementation of the ViewPager.OnPageChangeListener interface with stub implementations of each method.
zh_cn: 使用每种方法的存根实现简单实现 ViewPager.OnPageChangeListener 接口。

source: Simple marker annotations (e.g. @Override) can be listed on the same line with the language element.
zh_cn: 简单的标记注释(例如 @Override)可以与语言元素列在同一行。

source: Simply put, Canvas defines shapes that you can draw on the screen, while Paint defines the color, style, font, and so forth of each shape you draw.
zh_cn: 简单地说，Canvas 定义可以在屏幕上绘制的形状，而 Paint 定义你绘制的每个形状的颜色，样式，字体等。

source: Since RecyclerView is a collection ViewGroup that includes virtual children (items that are in the Adapter but not visible in the UI), it employs a more involved focus search strategy that differs from other ViewGroups.
zh_cn: 因为 RecyclerView 是包含虚拟子 view(adapter 中的子 view 但 UI 不可见)的 ViewGroup 集合，因此它采用了与其他 ViewGroups 考虑更多的焦点搜索策略。

source: Since it will be re-used to display different items in the data set, it is a good idea to cache references to sub views of the View to avoid unnecessary View#findViewById(int) calls.
zh_cn: 由于它将被重用以显示数据集中的不同项，因此最好缓存对 View 的子 view 的引用，以避免不必要的 View#findViewById(int) 调用。

source: Since many consider this a low priority issue, just use your judgement and be consistent.
zh_cn: 由于许多人认为这个问题不太重要，因此你只需在保持一致的前提下自行决定即可。

source: Since padding is used to offset content for shadows, you cannot set padding on CardView.
zh_cn: 由于 padding 用于偏移阴影的内容，因此无法在 CardView 上设置 padding。

source: Since the default functionality of FileProvider includes content URI generation for files, you don't need to define a subclass in code.
zh_cn: 由于 FileProvider 的默认功能包括为文件生成 content URI ，因此你无需在代码中定义子类。

source: Since there is no OnHeaderDecodedListener, the default settings will be used.
zh_cn: 由于没有 OnHeaderDecodedListener，因此将使用默认设置。

source: Since this flag is a modifier for SYSTEM_UI_FLAG_FULLSCREEN and SYSTEM_UI_FLAG_HIDE_NAVIGATION, it only has an effect when used in combination with one or both of those flags.
zh_cn: 由于此标志是 SYSTEM_UI_FLAG_FULLSCREEN 和 SYSTEM_UI_FLAG_HIDE_NAVIGATION 的修饰符，因此仅当与一个或两个标志组合使用时才有效。

source: Since this flag is a modifier for SYSTEM_UI_FLAG_HIDE_NAVIGATION, it only has an effect when used in combination with that flag.
zh_cn: 由于此标志是 SYSTEM_UI_FLAG_HIDE_NAVIGATION 的修饰符，因此仅在与该标志组合使用时才有效。

source: Size of the image, without scaling or cropping.
zh_cn: 图像大小，无缩放或裁剪。

source: SlidingDrawer can be used vertically or horizontally.
zh_cn: SlidingDrawer 可以垂直或水平使用。

source: SlidingDrawer hides content out of the screen and allows the user to drag a handle to bring the content on screen.
zh_cn: SlidingDrawer 将内容隐藏在屏幕外，并允许用户拖动句柄以将内容显示在屏幕上。

source: SlidingDrawer should be used as an overlay inside layouts.
zh_cn: SlidingDrawer 应该用作布局内的叠加层。

source: SlidingPaneLayout is distinct from a navigation drawer as described in the design guide and should not be used in the same scenarios.
zh_cn: SlidingPaneLayout 与设计指南中描述的导航抽屉不同，不应在相同的场景中使用。

source: SlidingPaneLayout provides a horizontal, multi-pane layout for use at the top level of a UI.
zh_cn: SlidingPaneLayout 提供了一个水平的多窗格布局，可以在 UI 的顶层使用。

source: SlidingPaneLayout should be thought of only as a way to allow a two-pane layout normally used on larger screens to adapt to smaller screens in a natural way.
zh_cn: SlidingPaneLayout 应该被认为只是一种允许通常在较大屏幕上使用的双窗格布局以自然方式适应较小屏幕的方法。

source: Smile: the compiler just made it easier for you to catch runtime problems in your code.
zh_cn: 你应该微笑：因为编译器让你能够更加轻松地捕获代码中的运行时错误。

source: So a vertical plane (the left and right sides) of a view can be constrained only to another vertical plane; and baselines can constrain only to other baselines.
zh_cn: 因此，view 的垂直平面(左侧和右侧)可以仅被约束到另一个垂直平面；并且基线只可以约束其他基线。

source: So be sure you include other constraints to achieve the proper position for each view in the chain, such as alignment constraints.
zh_cn: 因此，请确保包括其他约束，以实现链中每个 view 的正确位置，例如 alignment constraints。

source: So the view with the highest weight value gets the most amount of space; views that have the same weight get the same amount of space.
zh_cn: 因此，具有最高权重值的 view 获得最大的空间量;具有相同重量的 view 获得相同的空间量。

source: So you can build your layout with ConstraintLayout entirely by drag-and-dropping instead of editing the XML.
zh_cn: 因此你可以完全通过拖拽的方式去构建一个使用 ConstraintLayout，而不用直接在 XML 中编辑。

source: So, before you draw anything, you need to create one or more Paint objects.
zh_cn: 因此，在绘制任何内容之前，需要创建一个或多个 Paint 对象。

source: Solutions to the problem
zh_cn: 解决问题的方法

source: Some Iterator implementations (including those of all the general purpose collection implementations provided by the JRE) may choose to throw this exception if this behavior is detected.
zh_cn: 如果检测到这种行为，一些迭代器实现(包括 JRE 提供的所有通用 collection 实现)可能选择抛出此异常。

source: Some formats, like PNG which is lossless, will ignore the quality setting
zh_cn: 某些格式（如无损 PNG）会忽略质量设置

source: Some general properties that a LayoutManager may want to use.
zh_cn: 一些 LayoutManager 可能要使用的常规的属性。

source: Some images don't require a static image resource; the framework can dynamically draw the image at runtime instead.
zh_cn: 某些图像不需要静态图像资源;框架可以在运行时动态绘制图像。

source: Some initializations may be completely unnecessary: for example, initializing state information for the main activity, when the app has actually started up in response to an intent.
zh_cn: 某些初始化可能完全没有必要：例如，当应用程序实际启动以响应 intent 时，为主 activity 初始化状态信息。

source: Some of these are passed through to the View superclass, but more importantly, there are some custom attributes defined and used for LabelView.
zh_cn: 一些参数是传给父类使用的，但更重要的是为 LabelView 定义和使用一些自定义属性。

source: Some people prefer static imports to be interspersed with the remaining imports, while some prefer them to reside above or below all other imports.
zh_cn: 有些人希望静态导入穿插在其他导入语句之间，而有些人更希望其位于其他所有导入语句的上方或下方。

source: Some points to note here
zh_cn: 一些要注意的要点：

source: Some virtual machines may, under some circumstances, omit one or more stack frames from the stack trace.
zh_cn: 在某些情况下，某些虚拟机可能从堆栈跟踪中省略一个或多个堆栈帧。

source: Sometimes it is essential that an application be able to verify that an action is being performed with the full knowledge and consent of the user, such as granting a permission request, making a purchase or clicking on an advertisement.
zh_cn: 有时很基本的一点是，提醒用户他要执行的动作需完全知晓并同意，比如同意权限请求，进行购买或点击一个广告。

source: Sometimes the Displayed line in the logcat output contains an additional field for total time.
zh_cn: 有时，logcat 输出中的 Displayed 行包含总时间的附加字段。

source: SortedList works if you only need to handle insert and remove events, and has the benefit that you only ever need to have a single copy of the list in memory.
zh_cn: 如果你只需要处理插入和移除事件，SortedList 就可以工作，并且你只需要在内存中拥有该列表的单个副本。

source: Source and Destination
zh_cn: 源与目标

source: Source image
zh_cn: 源图像

source: Source of encoded image data.
zh_cn: 编码图像数据的来源。

source: Space
zh_cn: 空间

source: Space between children may be specified either by using instances of the dedicated Space view or by setting the ViewGroup.MarginLayoutParams#leftMargin, ViewGroup.MarginLayoutParams#topMargin, ViewGroup.MarginLayoutParams#rightMargin and ViewGroup.MarginLayoutParams#bottomMargin layout parameters.
zh_cn: 子项之间的空间可以通过使用专用 Space view 的实例指定，或通过设置 ViewGroup.MarginLayoutParams#leftMargin，ViewGroup.MarginLayoutParams#topMargin，ViewGroup.MarginLayoutParams#rightMargin 和 ViewGroup.MarginLayoutParams#bottomMargin 布局参数。

source: Space is a lightweight View subclass that may be used to create gaps between components in general purpose layouts.
zh_cn: Space 是一个轻量级的 View 子类，可用于在通用布局中创建组件之间的间隙。

source: Spaces a set of widgets horizontal between the view startID and endId.
zh_cn: 在 startId 和 endId 的 view 间横向放置一组部件。

source: Spaces a set of widgets vertically between the view topId and bottomId.
zh_cn: 在 topId 和 bottomId 的 view 间垂直放置一组部件。

source: SparseArrays map integers to Objects.
zh_cn: SparseArrays 将整数映射到对象。

source: Special TabHost that allows the use of Fragment objects for its tab content.
zh_cn: 特殊 TabHost，允许使用 Fragment 对象作为其选项卡内容。

source: Special constant for setSystemUiVisibility(int): View has requested the system UI (status bar) to be visible (the default).
zh_cn: 用于 setSystemUiVisibility(int) 的特殊常量值： View 请求系统 UI(状态栏)可见(默认值)。

source: Specialization of EditText for showing and interacting with the extracted text in a full-screen input method.
zh_cn: EditText 的专业化，用于在全屏输入法中显示和与提取的文本交互。

source: Specialized ViewSwitcher that contains only children of type TextView.
zh_cn: 专用 ViewSwitcher，仅包含 TextView 类型的子项。

source: Specifically, the controls will float above the view specified with setAnchorView().
zh_cn: 具体来说，控件将浮动在 setAnchorView() 指定的 view 上方。

source: Specifically, there is no need to log situations where an exception is thrown (the exception should contain all the relevant information), or where the only information being logged is contained in an error code.
zh_cn: 具体来说，当抛出异常(异常中应该会包含所有相关信息)或者所记录的所有信息都包含在错误代码中时，则不需要记录此类情况。

source: Specifies a theme override for a view.
zh_cn: 指定 view 的主题重写。

source: Specifies extra space on the bottom side of the toolbar's title.
zh_cn: 指定工具栏标题底部的额外空间。

source: Specifies extra space on the end side of the toolbar's title.
zh_cn: 指定工具栏标题末尾的额外空间。

source: Specifies extra space on the left, start, right and end sides of the toolbar's title.
zh_cn: 指定工具栏标题左侧，开始，右侧和结尾的额外空间。

source: Specifies extra space on the start side of the toolbar's title.
zh_cn: 指定工具栏标题开头的额外空间。

source: Specifies extra space on the top side of the toolbar's title.
zh_cn: 指定工具栏标题顶部的额外空间。

source: Specifies how a view is positioned within a RelativeLayout.
zh_cn: 指定 view 在 RelativeLayout 中的定位方式。

source: Specifies how an object should position its content, on both the X and Y axes, within its own bounds.
zh_cn: 指定对象如何在其自己的边界内在 X 轴和 Y 轴上定位其内容。

source: Specifies how closed shapes (e.g.
zh_cn: 指定闭合形状的方式（例如。

source: Specifies how closed shapes (e.g. rects, ovals) are oriented when they are added to a path.
zh_cn: 指定将闭合形状(例如，rects，ovals)添加到路径时的方向。

source: Specifies subtitle text used for navigationMode="normal".
zh_cn: 指定用于 navigationMode =“normal” 的副标题文本。

source: Specifies that "inside" is computed by a non-zero sum of signed edge crossings.
zh_cn: 指定 "inside" 由带符号的边交叉的非零和计算（非零环绕数规则(Nonzero-rule)）。

source: Specifies that "inside" is computed by an odd number of edge crossings.
zh_cn: 指定 "内部" 由交叉边的奇数计算（奇偶规则(Even–odd rule)）。

source: Specifies that the given permission is required for read operations.
zh_cn: 指示给定的权限是读操作所需的。

source: Specifies that the given permission is required for write operations.
zh_cn: 指示给定的权限是写操作所需的。

source: Specifies the basic height of the dropdown.
zh_cn: 指定下拉列表的基本高度。

source: Specifies the basic width of the dropdown.
zh_cn: 指定下拉列表的基本宽度。

source: Specifies the fixed width for each column.
zh_cn: 指定每列的固定宽度。

source: Specifies the formatting pattern used to show the time and/or date in 12-hour mode.
zh_cn: 指定用于以 12 小时模式显示时间和/或日期的格式模式。

source: Specifies the formatting pattern used to show the time and/or date in 24-hour mode.
zh_cn: 指定用于以 24 小时模式显示时间和/或日期的格式设置模式。

source: Specifies the gravity within each cell.
zh_cn: 指定每个单元格内的重力。

source: Specifies the known formats a bitmap can be compressed into
zh_cn: 指定位图可以压缩到的已知格式

source: Specifies the theme to use when inflating popup menus.
zh_cn: 指定在弹出弹出菜单时使用的主题。

source: Specifies the time zone to use.
zh_cn: 指定要使用的时区。

source: Specifies the type of layer backing this view.
zh_cn: 指定支持此 view 的图层类型。

source: Specifies whether this Chronometer counts down or counts up from the base.
zh_cn: 指定此计时器是否向下计数或从基数开始向上计数。

source: Specifies whether to filter touches when the view's window is obscured by another visible window.
zh_cn: 指定当 view 的窗口被另一个可见窗口遮挡时是否过滤触摸。

source: Specify a maximum height size for the widget.
zh_cn: 指定部件的最大高度。

source: Specify a maximum width size for the widget.
zh_cn: 指定部件的最大宽度。

source: Specify a minimum height size for the widget.
zh_cn: 指定部件的最小高度。

source: Specify a minimum width size for the widget.
zh_cn: 指定部件的最小宽度。

source: Specify background tint using the app:backgroundTint and app:backgroundTintMode attributes, which accepts either a color or a color state list.
zh_cn: 使用 app:backgroundTint 和 app:backgroundTintMode 属性，可接受颜色或颜色状态列表。

source: Specify the desired ColorSpace for the output.
zh_cn: 为输出指定所需的 ColorSpace。

source: Specify the memory policy for the decoded Bitmap.
zh_cn: 为解码的 Bitmap 指定内存策略。

source: Specify the radius of all four corners of the button using the app:cornerRadius attribute.
zh_cn: 使用 app:cornerRadius 属性指定按钮的所有四个角的半径。

source: Specify the size of the output Drawable or Bitmap.
zh_cn: 指定输出 Drawable 或 Bitmap 的大小。

source: Specify the typeface by calling setTypeface(), and the text color by calling setColor().
zh_cn: 通过调用 setTypeface() 指定字体，通过调用 setColor() 指定文本颜色。

source: Specify values for the attributes in your XML layout
zh_cn: 在 XML 布局中指定属性的值

source: Specify whether the Bitmap should be mutable.
zh_cn: 指定 Bitmap 是否应该是可变的。

source: Specify whether the Bitmap should have unpremultiplied pixels.
zh_cn: 指定 Bitmap 是否应具有未预乘的像素。

source: Specify whether to potentially treat the output as an alpha mask.
zh_cn: 指定是否可能将输出视为 alpha 蒙版。

source: Specifying Available Files
zh_cn: 指定可用的文件
